tap "airplanedev/tap"
tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "cloudquery/tap"
tap "cue-lang/tap"
tap "dagger/tap"
tap "dopplerhq/cli"
tap "earthly/earthly"
tap "ellie/atuin"
tap "go-task/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hookdeck/hookdeck"
tap "infisical/get-cli"
tap "nektos/tap"
tap "temporalio/brew"
tap "thought-machine/please"
tap "withgraphite/tap"
brew "act"
brew "openssl@3"
brew "apr-util"
brew "asciinema"
brew "ast-grep"
brew "atuin"
brew "aws-nuke"
brew "python@3.10"
brew "azure-cli"
brew "bazelisk"
brew "glib"
brew "openjdk"
brew "bfg"
brew "circleci"
brew "python@3.11"
brew "cookiecutter"
brew "node"
brew "corepack"
brew "cowsay"
brew "deno"
brew "dive"
brew "flake8"
brew "flyctl"
brew "fortune"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-review"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "libusb"
brew "gnupg"
brew "go"
brew "helm"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "k6"
brew "kind"
brew "kompose"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lua"
brew "minikube"
brew "neofetch"
brew "node@16"
brew "nvm"
brew "postgresql@14"
brew "postgresql@15"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.8"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "ruff"
brew "rust"
brew "sbt"
brew "semgrep"
brew "shellcheck"
brew "skaffold"
brew "subversion"
brew "tailscale"
brew "temporal"
brew "terraform"
brew "terraform-docs"
brew "terraformer"
brew "terragrunt"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "tree"
brew "trunk"
brew "vercel-cli"
brew "watch"
brew "yq"
brew "airplanedev/tap/airplane"
brew "bufbuild/buf/buf"
brew "cloudflare/cloudflare/cloudflared"
brew "cloudquery/tap/cloudquery"
brew "cue-lang/tap/cue"
brew "dagger/tap/dagger"
brew "dopplerhq/cli/doppler"
brew "earthly/earthly/earthly"
brew "go-task/tap/go-task"
brew "heroku/brew/heroku"
brew "hookdeck/hookdeck/hookdeck"
brew "infisical/get-cli/infisical"
brew "temporalio/brew/tcld"
brew "thought-machine/please/please"
brew "withgraphite/tap/graphite"
cask "amethyst"
cask "caffeine"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "font-awesome-terminal-fonts"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "http-toolkit"
cask "inkscape"
cask "iterm2"
cask "ngrok"
cask "postman"
cask "raycast"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "warp"
vscode "alexkrechik.cucumberautocomplete"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "capaj.graphql-codegen-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "CodeQue.codeque"
vscode "Compilenix.vscode-zonefile"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "grit.grit-vscode"
vscode "hashicorp.terraform"
vscode "henrynguyen5-vsc.vsc-nvm"
vscode "Intuita.intuita-vscode-extension"
vscode "jallen7usa.vscode-cue-fmt"
vscode "JuanBlanco.solidity"
vscode "mattlott.copy-github-url"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nextfaze.json-parse-stringify"
vscode "nickgo.cuelang"
vscode "nrwl.angular-console"
vscode "Orta.vscode-jest"
vscode "please-build.plz-vscode"
vscode "pomber.git-file-history"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rohit-gohri.format-code-action"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "semanticdiff.semanticdiff"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vunguyentuan.vscode-css-variables"
vscode "vunguyentuan.vscode-postcss"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
