tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "cloudquery/tap"
tap "cue-lang/tap"
tap "dagger/tap"
tap "dopplerhq/cli"
tap "earthly/earthly"
tap "ellie/atuin"
tap "go-task/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "hookdeck/hookdeck"
tap "infisical/get-cli"
tap "messense/macos-cross-toolchains"
tap "nektos/tap"
tap "temporalio/brew"
tap "thought-machine/please"
tap "withgraphite/tap"
brew "act"
brew "giflib"
brew "libpng"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "apr-util"
brew "python@3.12"
brew "asciinema"
brew "ast-grep"
brew "atuin"
brew "automake"
brew "aws-nuke"
brew "cryptography"
brew "awscli"
brew "python@3.11"
brew "azure-cli"
brew "bazelisk"
brew "glib"
brew "pixman"
brew "cairo"
brew "harfbuzz"
brew "bfg"
brew "ccache"
brew "circleci"
brew "cloudflared"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "cowsay"
brew "deno"
brew "direnv"
brew "dive"
brew "unbound"
brew "gnutls"
brew "pango"
brew "ffmpeg"
brew "flake8"
brew "fluent-bit"
brew "flyctl"
brew "fortune"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-review"
brew "gnu-sed"
brew "libusb"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gradle"
brew "libtool"
brew "pkgconf"
brew "guile"
brew "helm"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "k6"
brew "kind"
brew "kompose"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "libgit2"
brew "libiconv"
brew "librsvg"
brew "llvm"
brew "llvm@16"
brew "lua"
brew "maven"
brew "minikube"
brew "n"
brew "neofetch"
brew "nginx"
brew "ninja"
brew "nvm"
brew "pandoc"
brew "pnpm"
brew "postgresql@14"
brew "postgresql@15"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-setuptools"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "ruff"
# DO NOT install rust from homebrew, use rustup instead
# brew "rust"
brew "sbt"
brew "semgrep"
brew "shellcheck"
brew "skaffold"
brew "subversion"
brew "tailscale"
brew "temporal"
brew "terraform"
brew "terraform-docs"
brew "terraformer"
brew "terragrunt"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "tree"
brew "trunk"
brew "vercel-cli"
brew "watch"
brew "yq"
brew "bufbuild/buf/buf"
brew "cirruslabs/cli/tart"
brew "cloudquery/tap/cloudquery"
brew "cue-lang/tap/cue"
brew "dagger/tap/dagger"
brew "dopplerhq/cli/doppler"
brew "earthly/earthly/earthly"
brew "go-task/tap/go-task"
brew "heroku/brew/heroku"
brew "hookdeck/hookdeck/hookdeck"
brew "infisical/get-cli/infisical"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "temporalio/brew/tcld"
brew "thought-machine/please/please"
brew "withgraphite/tap/graphite"
cask "caffeine"
cask "discord"
cask "docker"
cask "font-awesome-terminal-fonts"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "http-toolkit"
cask "iterm2"
cask "ngrok"
cask "postman"
cask "raycast"
cask "session-manager-plugin"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "warp"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "coder.coder-remote"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "fabiospampinato.vscode-highlight"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "grit.grit-vscode"
vscode "hashicorp.terraform"
vscode "henrynguyen5-vsc.vsc-nvm"
vscode "jallen7usa.vscode-cue-fmt"
vscode "juanblanco.solidity"
vscode "mattlott.copy-github-url"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "nextfaze.json-parse-stringify"
vscode "nickgo.cuelang"
vscode "oracle.oracle-java"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rohit-gohri.format-code-action"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "semanticdiff.semanticdiff"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vunguyentuan.vscode-css-variables"
vscode "vunguyentuan.vscode-postcss"
vscode "wix.vscode-import-cost"
