tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
brew "python@3.9"
brew "asciinema"
brew "azure-cli"
brew "openjdk"
brew "bfg"
brew "cookiecutter"
brew "go"
brew "dep"
brew "flake8"
brew "gh"
brew "git"
brew "git-credential-manager"
brew "git-review"
brew "glib"
brew "nghttp2"
brew "unbound"
brew "gnupg"
brew "htop"
brew "hugo"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "libgit2"
brew "lua"
brew "node"
brew "python-yq"
brew "python@3.8"
brew "rbenv"
brew "ruby"
brew "shellcheck"
brew "sshfs"
brew "subversion"
brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "tmux"
brew "virtualenv"
brew "wireguard-tools"
brew "nektos/tap/act"
cask "amethyst"
cask "armory"
cask "caffeine"
cask "docker"
cask "fly"
cask "font-awesome-terminal-fonts"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "inkscape"
cask "iterm2"
cask "ngrok"
cask "osxfuse"
cask "postman"
cask "spotify"
cask "steam"
cask "visual-studio-code"
